#+title: Python

** целочисленное деление
#+begin_src python
return 17//3
#+end_src

#+RESULTS:
: 5
** остаток от деления
#+begin_src python
return 17%3
#+end_src

#+RESULTS:
: 2
** убрать конец строки в многострочнике с \
#+begin_src python
return """\
hello
\
    world

hello
    world"""
#+end_src

#+RESULTS:
: hello
:     world
:
: hello
:     world
** в питоне всё является объектом (value, id, type)
#+begin_src python
a = 42 # value
return a, id(a), type(a)
#+end_src

#+RESULTS:
| 42 | 139797617029768 | <class | int | > |
** сравнение id и value
#+begin_src python
a = [1,2,3]
b = [1,2,3]
return a is b, a == b
#+end_src

#+RESULTS:
| False | True |
** разделитель в часлах
#+begin_src python
return 1_000_000
#+end_src

#+RESULTS:
: 1000000
** пример с добавлением ведущей размерности
#+begin_src python
import numpy as np
a = np.arange(30).reshape(3, -1) # a = np.arange(30).reshape(3, 10)
b = np.arange(a.shape[1]) # b = np.arange(10), (10) последняя ось отвутствует (к массиву меньшей размерности добавились ведущие фиктивные размерности)
return a + b
#+end_src

#+RESULTS:
: array([[ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18],
:        [10, 12, 14, 16, 18, 20, 22, 24, 26, 28],
:        [20, 22, 24, 26, 28, 30, 32, 34, 36, 38]])

** пример с общей размерностью оси 0
#+begin_src python
import numpy as np
a = np.arange(30).reshape(3, -1) # a = np.arange(30).reshape(3, 10)
b = np.arange(a.shape[0])[:, np.newaxis] # b = np.arange(3).reshape(3, 1), размерность оси 1 равна 1
return a + b
#+end_src

#+RESULTS:
: array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
:        [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
:        [22, 23, 24, 25, 26, 27, 28, 29, 30, 31]])

** пример с различными размерностями
#+begin_src python
import numpy as np
a = np.arange(5).reshape(1, -1) # shape(1, 5)
b = a.reshape(-1, 1) # shape(5, 1)
return a + b
#+end_src

#+RESULTS:
: array([[0, 1, 2, 3, 4],
:        [1, 2, 3, 4, 5],
:        [2, 3, 4, 5, 6],
:        [3, 4, 5, 6, 7],
:        [4, 5, 6, 7, 8]])
